system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    ( 1  7  1)
    ( 1  7 -1)
    ( 1 -1  1)
    ( 1 -1 -1)
    (-1  7  1)
    (-1  7 -1)
    (-1 -1  1)
    (-1 -1 -1)
);

blocks
(
    hex (3 1 5 7 2 0 4 6) (80 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (1 0 2 3)
            (4 6 2 0)
            (5 7 6 4)
            (1 3 7 5)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 4 0 1)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
